app/controllers/students_controller.rb

  def show
    @student = Student.find(params[:id])
---
SELECT  "students".* FROM "students" WHERE (edit) LIMIT 1

  def update
    @student = Student.find(params[:id])
    @student.update(student_params)
---
UPDATE "students" SET "last_name" = ?, "updated_at" = ? WHERE "students"."id" = ?  [["last_name", "Hudge"], ["updated_at", "2017-05-02 17:11:08.528358"], ["id", 1]]